IDEA Open Model
ResultOfIncrement2 Class
Compatible with IDEA StatiCa Beta 20.0
Note: This API is now obsolete.
 Result of internal forces in the one position
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultOfIncrement2
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[ObsoleteAttribute]
public class ResultOfIncrement2
<ObsoleteAttribute>
Public Class ResultOfIncrement2
The ResultOfIncrement2 type exposes the following members.
Constructors
Name | Description
ResultOfIncrement2
Initializes a new instance of the ResultOfIncrement2 class
Top
Properties
Name | Description
AxialForce
 Axial force
AxialStrain
 Axial strain
AxialStress
 Axial stress
Increment
 Increment of load case
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace